###############################################################################
# Created by write_sdc
# Sat May 11 21:16:13 2024
###############################################################################
current_design axi_interconnect
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1.4096 [get_ports {AXI_CLK}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {AXI_RSTn}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WSTRB[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WSTRB[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WSTRB[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WSTRB[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WSTRB[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WSTRB[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WSTRB[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WSTRB[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWADDR[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWBURST[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWBURST[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWLEN[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWSIZE[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWSIZE[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWSIZE[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WSTRB[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WSTRB[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WSTRB[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WSTRB[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RDATA[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RID[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RLAST}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RRESP[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RRESP[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RVALID}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WREADY}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {penable}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {psel}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[0]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[10]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[11]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[12]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[13]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[14]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[15]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[16]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[17]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[18]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[19]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[1]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[20]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[21]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[22]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[23]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[24]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[25]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[26]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[27]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[28]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[29]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[2]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[30]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[31]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[3]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[4]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[5]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[6]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[7]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[8]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[9]}]
set_input_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwrite}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_ARREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_AWREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_BVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_RVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M0_AXI_WREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_ARREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_AWREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_BVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_RVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M1_AXI_WREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_ARREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_AWREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_BVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RRESP[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RRESP[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_RVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {M2_AXI_WREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_ARVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_AWVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_BREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_RREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WSTRB[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WSTRB[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WSTRB[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WSTRB[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S0_AXI_WVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_ARVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_AWVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_BREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_RREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WSTRB[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WSTRB[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WSTRB[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WSTRB[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S1_AXI_WVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_ARVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWADDR[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWBURST[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWBURST[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWLEN[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWSIZE[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWSIZE[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWSIZE[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_AWVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_BREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_RREADY}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WDATA[9]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WID[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WLAST}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WSTRB[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WSTRB[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WSTRB[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WSTRB[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {S2_AXI_WVALID}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[0]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[10]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[11]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[12]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[13]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[14]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[15]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[16]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[17]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[18]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[19]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[1]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[20]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[21]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[22]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[23]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[24]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[25]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[26]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[27]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[28]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[29]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[2]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[30]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[31]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[3]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[4]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[5]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[6]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[7]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[8]}]
set_output_delay 0.5600 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
